# Brewfile - 필수 패키지와 애플리케이션

# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "d12frosted/emacs"
tap "felixkratz/formulae" # for aerospace

# CLI 도구
brew "git"       # 버전 관리 시스템
brew "curl"      # URL 다운로드 도구
brew "wget"      # 또 다른 다운로드 도구
brew "tmux"      # 터미널 멀티플렉서
brew "neovim"    # 향상된 Vim 편집기
brew "ripgrep"   # 빠른 검색 도구
brew "fzf"       # 퍼지 파인더
brew "yazi"      # 터미널 파일 관리자
brew "fd"        # 향상된 find 명령어
brew "jq"        # JSON 처리 도구
brew "gh"        # GitHub CLI
brew "lazygit"   # Git TUI
brew "tree"      # 디렉토리 트리 표시
brew "git-delta" # 개선된 diff 도구
brew "tree-sitter" # 코드 파싱 라이브러리
brew "postgresql@15" # PostgreSQL 데이터베이스
brew "node"      # Node.js
brew "python@3.12" # Python 3.12
brew "scrcpy"    # 안드로이드 화면 미러링
brew "aerospace" # 윈도우 매니저 (macOS용)

# 개발 툴
cask "wezterm"              # 터미널 에뮬레이터
cask "karabiner-elements"   # 키보드 커스터마이저
cask "rectangle"            # 창 관리 도구
cask "docker"               # 컨테이너 플랫폼
cask "jetbrains-toolbox"    # JetBrains IDE 관리 도구
cask "google-chrome"        # 웹 브라우저
cask "slack"                # 커뮤니케이션 도구
cask "obsidian"             # 지식 베이스 도구
cask "notion"               # 생산성 도구
cask "discord"              # 커뮤니케이션 도구
cask "spotify"              # 음악 스트리밍
cask "postman"              # API 테스트 도구
cask "figma"                # 디자인 도구

# 폰트
cask "font-jetbrains-mono-nerd-font"  # 개발용 폰트