# Brewfile - 필수 패키지와 애플리케이션

# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# CLI 도구
brew "git"       # 버전 관리 시스템
brew "curl"      # URL 다운로드 도구
brew "wget"      # 또 다른 다운로드 도구
brew "tmux"      # 터미널 멀티플렉서
brew "neovim"    # 향상된 Vim 편집기
brew "ripgrep"   # 빠른 검색 도구
brew "fzf"       # 퍼지 파인더
brew "yazi"      # 터미널 파일 관리자
brew "fd"        # 향상된 find 명령어
brew "jq"        # JSON 처리 도구
brew "gh"        # GitHub CLI

# 개발 툴
cask "wezterm"              # 터미널 에뮬레이터
cask "karabiner-elements"   # 키보드 커스터마이저
cask "rectangle"            # 창 관리 도구

# 폰트
cask "font-jetbrains-mono-nerd-font"  # 개발용 폰트
